[Survived] ArithmeticOperator
git/retrier/src/Ipolicy.ts:17:35
     constructor(max_tries: number = 5, init_wait_time: number = 500) {
         this.max_tries = max_tries
         this.init_wait_time = init_wait_time
-        this.max_time = max_tries * init_wait_time
+        this.max_time = max_tries / init_wait_time
         this.retry_count = 0
     }

[Survived] BlockStatement
git/retrier/src/Ipolicy.ts:24:48
         return this.init_wait_time
     }
     can_retry() {
-        if (this.retry_count < this.max_tries) {
-            return true
-        }
+        if (this.retry_count < this.max_tries) {}
         return false
     }

[Survived] EqualityOperator
git/retrier/src/Ipolicy.ts:24:30
         return this.init_wait_time
     }
     can_retry() {
-        if (this.retry_count < this.max_tries) {
+        if (this.retry_count >= this.max_tries) {
             return true
         }

[Survived] BooleanLiteral
git/retrier/src/Ipolicy.ts:25:20
     }
     can_retry() {
         if (this.retry_count < this.max_tries) {
-            return true
+            return false
         }
         return false

[Survived] BooleanLiteral
git/retrier/src/Ipolicy.ts:27:16
         if (this.retry_count < this.max_tries) {
             return true
         }
-        return false
+        return true
     }
     increment_try() {

[Survived] BlockStatement
git/retrier/src/Ipolicy.ts:29:21
         }
         return false
     }
-    increment_try() {
-        this.retry_count++
-    }
+    increment_try() {}
 }
 

[Survived] UpdateOperator
git/retrier/src/Ipolicy.ts:30:9
         return false
     }
     increment_try() {
-        this.retry_count++
+        this.retry_count--
     }
 }
