[Killed] ArithmeticOperator
git/retrier/src/Ipolicy.ts:17:29
   constructor(maxTries = 5, initWaitTime = 500) {
     this.maxTries = maxTries;
     this.initWaitTime = initWaitTime;
-    this.maxTime = maxTries * initWaitTime;
+    this.maxTime = maxTries / initWaitTime;
     this.retryCount = 0;
   }

[Killed] BlockStatement
git/retrier/src/Ipolicy.ts:24:42
     return this.initWaitTime;
   }
   canRetry() {
-    if (this.retryCount < this.maxTries) {
-      return true;
-    }
+    if (this.retryCount < this.maxTries) {}
     return false;
   }

[Killed] EqualityOperator
git/retrier/src/Ipolicy.ts:24:25
     return this.initWaitTime;
   }
   canRetry() {
-    if (this.retryCount < this.maxTries) {
+    if (this.retryCount >= this.maxTries) {
       return true;
     }

[Killed] BooleanLiteral
git/retrier/src/Ipolicy.ts:25:14
   }
   canRetry() {
     if (this.retryCount < this.maxTries) {
-      return true;
+      return false;
     }
     return false;

[Killed] BlockStatement
git/retrier/src/Ipolicy.ts:29:18
     }
     return false;
   }
-  incrementTry() {
-    this.retryCount++;
-  }
+  incrementTry() {}
 }
 

[Killed] UpdateOperator
git/retrier/src/Ipolicy.ts:30:5
     return false;
   }
   incrementTry() {
-    this.retryCount++;
+    this.retryCount--;
   }
 }
