[Killed] BlockStatement
git/retrier/src/retryer.ts:1:40
-export function retryer(fn: () => any) {
-  try {
-    return fn();
-  } catch (error) {}
-}
+export function retryer(fn: () => any) {}
 

[Killed] BlockStatement
git/retrier/src/retryer.ts:2:7
 export function retryer(fn: () => any) {
-  try {
-    return fn();
-  } catch (error) {}
+  try {} catch (error) {}
 }
 
